papers/cdc16-1.html
---
layout: page
title: ! 'Secure Dynamic State Estimation via Local Estimators'
comments: true
---
<hr />
<p>
<b>Yilin Mo and Emanuele Garone</b>
</p>

<p>
<i>IEEE Conference on Decision and Control</i>, 2016
</p>

<p>
Link to the <a href="../../../public/papers/cdc16-1.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fcdc16-1.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-orgcfbe217" class="outline-2">
<h2 id="orgcfbe217">Abstract</h2>
<div class="outline-text-2" id="text-orgcfbe217">
<p>
We consider the problem of estimating the state of a linear time-invariant Gaussian system using \(m\) sensors, where a subset of the sensors can potentially be compromised by an adversary. We prove that under mild assumptions, we can decompose the optimal Kalman estimate as a weighted sum of local state estimates, each of which is derived using only the measurements from a single sensor. We then propose a convex optimization based approach, instead of the weighted sum approach, to combine the local estimate into a more secure state estimate. Our proposed estimator coincides with the Kalman estimator with certain probability when all sensors are benign and is stable when less than half of the sensors are compromised. Numerical simulations are provided to illustrate the performance of the proposed state estimation scheme.
</p>
</div>
</div>
